-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: db
-- ------------------------------------------------------
-- Server version	8.0.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `comment`
--

DROP TABLE IF EXISTS `comment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `comment` (
  `id` int NOT NULL AUTO_INCREMENT,
  `text` varchar(500) NOT NULL,
  `user_id` int NOT NULL,
  `date` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `comment`
--

LOCK TABLES `comment` WRITE;
/*!40000 ALTER TABLE `comment` DISABLE KEYS */;
INSERT INTO `comment` VALUES (1,'hkjhkb',2,'2022-09-26 21:20:12'),(2,'g4gte',2,'2022-09-26 21:20:22'),(3,'tgetger',2,'2022-09-26 21:20:38'),(4,'tgetger',2,'2022-09-26 21:21:33'),(5,'er',2,'2022-09-26 21:21:38'),(6,'er',2,'2022-09-26 21:21:54'),(7,'er',2,'2022-09-26 21:24:05'),(8,'nkjb',2,'2022-09-26 21:24:17'),(9,'lorem ipsum',2,'2022-09-26 21:58:48'),(10,'test author',1,'2022-09-26 22:00:58'),(11,'jhkjhkrwhkfch whfkjwhr fkh',3,'2022-09-26 22:27:50'),(12,'Test message',5,'2022-09-27 00:40:45'),(13,'test',5,'2022-09-27 00:43:08'),(14,'gwjhdefgk',5,'2022-09-27 00:43:18'),(15,'gwjhdefgk',5,'2022-09-27 01:16:32'),(16,'new comment',7,'2022-09-27 07:22:41'),(17,'апорцаг',7,'2022-09-27 09:11:30'),(18,'random',13,'2022-10-04 07:45:39'),(19,'new message',14,'2022-10-04 08:45:19'),(20,'New secret message',15,'2022-10-05 08:24:45');
/*!40000 ALTER TABLE `comment` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `comment_AFTER_INSERT` AFTER INSERT ON `comment` FOR EACH ROW BEGIN
	INSERT INTO log Set text = "Comment", user_id = NEW.user_id, date = NOW();
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;

--
-- Table structure for table `direction`
--

DROP TABLE IF EXISTS `direction`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `direction` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `university` varchar(50) NOT NULL,
  `ed_form` varchar(100) NOT NULL,
  `subjects` varchar(100) NOT NULL,
  `budget` int DEFAULT NULL,
  `paid` int DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=190 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `direction`
--

LOCK TABLES `direction` WRITE;
/*!40000 ALTER TABLE `direction` DISABLE KEYS */;
INSERT INTO `direction` VALUES (1,'Астрономия\n','КФУ\n','Специалитет | Очная\n','математика, русский, физика\n',237,118),(2,'Бизнес-информатика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, обществознание/история/информатика/иностранный язык\n',265,204),(3,'Биология\n','КФУ\n','Бакалавриат | Очная\n','русский, биология, математика/химия\n',242,188),(4,'Биотехнические системы и технологии\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',236,197),(5,'Биотехнология\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/химия/биология\n',NULL,118),(6,'Востоковедение и африканистика\n','КФУ\n','Бакалавриат | Очная\n','русский, история, обществознание/иностранный язык\n',270,210),(7,'География\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, география\n',239,119),(8,'Геодезия и дистанционное зондирование\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика\n',229,151),(9,'Геология\n','КФУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика\n',194,154),(10,'Гидрометеорология\n','КФУ\n','Бакалавриат | Очная\n','русский, география, математика/информатика\n',220,152),(11,'Гостиничное дело\n','КФУ\n','Бакалавриат | Заочная\n','русский, обществознание, история/иностранный язык\n',203,184),(12,'Государственное и муниципальное управление\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, обществознание/иностранный язык\n',259,206),(13,'Дизайн\n','КФУ\n','Бакалавриат | Очная, Очно-заочная\n','русский, обществознание/история/иностранный язык, вступительные\n',234,199),(14,'Журналистика\n','КФУ\n','Бакалавриат | Заочная, Очная\n','русский, литература, вступительные\n',234,208),(15,'Зарубежное регионоведение\n','КФУ\n','Бакалавриат | Очная\n','русский, история, обществознание/иностранный язык\n',260,211),(16,'Землеустройство и кадастры\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',212,137),(17,'Инноватика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/химия/информатика\n',259,169),(18,'Информационная безопасность\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика/иностранный язык\n',247,206),(19,'Информационная безопасность автоматизированных систем\n','КФУ\n','Специалитет | Очная\n','математика, русский, физика/информатика\n',237,196),(20,'Информационные системы и технологии\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика/иностранный язык\n',257,188),(21,'История\n','КФУ\n','Бакалавриат | Очная\n','русский, история, обществознание/иностранный язык\n',248,196),(22,'Картография и геоинформатика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, география\n',234,164),(23,'Клиническая психология\n','КФУ\n','Специалитет | Очная\n','русский, биология, математика/обществознание/иностранный язык\n',245,198),(24,'Конфликтология\n','КФУ\n','Бакалавриат | Очная\n','русский, обществознание, история/иностранный язык\n',276,203),(25,'Культурология\n','КФУ\n','Бакалавриат | Очная\n','русский, обществознание, история/иностранный язык\n',264,115),(26,'Лечебное дело\n','КФУ\n','Специалитет | Очная\n','русский, химия, биология\n',214,212),(27,'Лингвистика\n','КФУ\n','Бакалавриат | Очная, Очно-заочная\n','русский, иностранный язык, обществознание/история/литература\n',279,206),(28,'Математика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',243,157),(29,'Математика и компьютерные науки\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, информатика\n',244,196),(30,'Медиакоммуникации\n','КФУ\n','Бакалавриат | Очная\n','русский, литература, обществознание/иностранный язык\n',277,208),(31,'Медицинская биохимия\n','КФУ\n','Специалитет | Очная\n','русский, химия, биология\n',257,184),(32,'Международные отношения\n','КФУ\n','Бакалавриат | Очная\n','русский, обществознание, история, иностранный язык\n',350,265),(33,'Менеджмент\n','КФУ\n','Бакалавриат | Очно-заочная, Очная\n','математика, русский, обществознание/иностранный язык\n',265,124),(34,'Механика и математическое моделирование\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',246,176),(35,'Нанотехнологии и микросистемная техника\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/химия\n',236,118),(36,'Нефтегазовое дело\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика\n',236,172),(37,'Организация работы с молодежью\n','КФУ\n','Бакалавриат | Очная\n','русский, история, обществознание/иностранный язык\n',NULL,105),(38,'Педагогика и психология девиантного поведения\n','КФУ\n','Специалитет | Заочная, Очная\n','русский, обществознание, математика/биология/иностранный язык\n',238,203),(39,'Педагогическое образование\n','КФУ\n','Бакалавриат | Заочная, Очная\n','русский, обществознание, математика/биология/иностранный язык\n',180,165),(40,'Педагогическое образование (с двумя профилями подготовки)\n','КФУ\n','Бакалавриат | Очная, Очно-заочная, Заочная\n','русский, обществознание, математика/физика/химия/информатика/биология/география\n',212,185),(41,'Политология\n','КФУ\n','Бакалавриат | Очная\n','русский, история, обществознание/иностранный язык\n',245,197),(42,'Почвоведение\n','КФУ\n','Бакалавриат | Очная\n','русский, биология, математика/химия\n',198,184),(43,'Прикладная информатика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика/иностранный язык\n',254,201),(44,'Прикладная математика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика/иностранный язык\n',253,109),(45,'Прикладная математика и информатика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика/иностранный язык\n',258,220),(46,'Природообустройство и водопользование\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, химия/биология\n',198,118),(47,'Программная инженерия\n','КФУ\n','Бакалавриат | Очная, Дистанционная\n','математика, русский, информатика\n',272,223),(48,'Профессиональное обучение (по отраслям)\n','КФУ\n','Бакалавриат | Очная, Очно-заочная\n','математика, русский, обществознание\n',240,188),(49,'Психология\n','КФУ\n','Бакалавриат | Очно-заочная, Очная\n','русский, биология, математика/обществознание/иностранный язык\n',257,175),(50,'Психолого-педагогическое образование\n','КФУ\n','Бакалавриат | Заочная\n','русский, биология, математика/обществознание/иностранный язык\n',221,175),(51,'Радиофизика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика\n',217,118),(52,'Регионоведение России\n','КФУ\n','Бакалавриат | Очная\n','русский, история, обществознание/иностранный язык\n',254,206),(53,'Реклама и связи с общественностью\n','КФУ\n','Бакалавриат | Очная\n','русский, обществознание, история/информатика/иностранный язык\n',272,215),(54,'Сервис\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, обществознание/иностранный язык\n',258,217),(55,'Социология\n','КФУ\n','Бакалавриат | Очная\n','русский, обществознание, математика/история\n',250,206),(56,'Специальное (дефектологическое) образование\n','КФУ\n','Бакалавриат | Заочная, Очная\n','русский, биология, математика/обществознание/иностранный язык\n',221,178),(57,'Стоматология\n','КФУ\n','Специалитет | Очная\n','русский, химия, биология\n',NULL,204),(58,'Судебная и прокурорская деятельность\n','КФУ\n','Специалитет | Очная\n','русский, обществознание, история\n',NULL,194),(59,'Телевидение\n','КФУ\n','Бакалавриат | Очная\n','русский, литература, обществознание/история\n',257,204),(60,'Теология\n','КФУ\n','Бакалавриат | Очная\n','русский, история, обществознание/иностранный язык\n',218,157),(61,'Техническая физика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика\n',198,118),(62,'Торговое дело\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, обществознание/иностранный язык\n',NULL,194),(63,'Туризм\n','КФУ\n','Бакалавриат | Очная\n','русский, история, обществознание/иностранный язык\n',245,169),(64,'Управление качеством\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',213,175),(65,'Управление персоналом\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, обществознание/иностранный язык\n',NULL,197),(66,'Фармация\n','КФУ\n','Специалитет | Очная\n','русский, химия, биология\n',223,182),(67,'Физика\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика\n',233,164),(68,'Филология\n','КФУ\n','Бакалавриат | Очная, Очно-заочная\n','русский, литература, обществознание/история/иностранный язык\n',215,218),(69,'Философия\n','КФУ\n','Бакалавриат | Очная\n','русский, обществознание, история/иностранный язык\n',249,199),(70,'Фундаментальная и прикладная химия\n','КФУ\n','Специалитет | Очная\n','русский, химия, математика/физика/биология\n',255,190),(71,'Фундаментальные информатика и информационные технологии\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика/иностранный язык\n',260,207),(72,'Химия\n','КФУ\n','Бакалавриат | Очная\n','математика, русский, химия\n',247,181),(73,'Экология и природопользование\n','КФУ\n','Бакалавриат | Очная\n','русский, биология, математика/химия\n',223,164),(74,'Экономика\n','КФУ\n','Бакалавриат | Очно-заочная, Очная\n','математика, русский, обществознание/география/иностранный язык\n',267,198),(75,'Экономическая безопасность\n','КФУ\n','Специалитет | Очная\n','математика, русский, обществознание\n',NULL,198),(76,'Юриспруденция\n','КФУ\n','Бакалавриат | Очно-заочная, Очная\n','русский, обществознание, история\n',238,176),(77,'Автоматизация технологических процессов и производств\n','КГЭУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',216,118),(78,'Атомные станции: проектирование, эксплуатация и инжиниринг\n','КГЭУ\n','Специалитет | Очная\n','математика, русский, физика/информатика\n',NULL,118),(79,'Водные биоресурсы и аквакультура\n','КГЭУ\n','Бакалавриат | Очная\n','русский, биология, математика/химия\n',146,NULL),(80,'Информатика и вычислительная техника\n','КГЭУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',231,118),(81,'Менеджмент\n','КГЭУ\n','Бакалавриат | Очно-заочная, Очная\n','математика, русский, обществознание/информатика\n',NULL,123),(82,'Мехатроника и робототехника\n','КГЭУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',210,118),(83,'Приборостроение\n','КГЭУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',160,NULL),(84,'Прикладная информатика\n','КГЭУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',224,118),(85,'Прикладная математика\n','КГЭУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',217,118),(86,'Реклама и связи с общественностью\n','КГЭУ\n','Бакалавриат | Заочная, Очная\n','русский, обществознание, история/иностранный язык\n',NULL,115),(87,'Социология\n','КГЭУ\n','Бакалавриат | Заочная, Очная\n','русский, обществознание, математика/история/информатика\n',NULL,120),(88,'Теплоэнергетика и теплотехника\n','КГЭУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',179,118),(89,'Техносферная безопасность\n','КГЭУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/химия/информатика\n',165,118),(90,'Управление в технических системах\n','КГЭУ\n','Бакалавриат | Заочная\n','математика, русский, физика/информатика\n',NULL,118),(91,'Экономика\n','КГЭУ\n','Бакалавриат | Очно-заочная, Очная\n','математика, русский, обществознание/информатика\n',NULL,123),(92,'Электроника и наноэлектроника\n','КГЭУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',172,NULL),(93,'Электроэнергетика и электротехника\n','КГЭУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',187,118),(94,'Энергетическое машиностроение\n','КГЭУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',180,NULL),(95,'Авиастроение\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',201,118),(96,'Биотехнические системы и технологии\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',177,118),(97,'Двигатели летательных аппаратов\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',204,118),(98,'Инноватика\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',239,118),(99,'Инфокоммуникационные технологии и системы связи\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',221,118),(100,'Информатика и вычислительная техника\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',242,118),(101,'Информационная безопасность\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',249,118),(102,'Информационная безопасность телекоммуникационных систем\n','КНИТУ-КАИ\n','Специалитет | Очная\n','математика, русский, физика/информатика\n',243,118),(103,'Информационные системы и технологии\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',246,118),(104,'Конструирование и технология электронных средств\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',196,118),(105,'Конструкторско-технологическое обеспечение машиностроительных производств\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',181,118),(106,'Кораблестроение, океанотехника и системотехника объектов морской инфраструктуры\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',171,118),(107,'Лазерная техника и лазерные технологии\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',199,118),(108,'Материаловедение и технологии материалов\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/химия/информатика\n',186,118),(109,'Машиностроение\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',190,128),(110,'Менеджмент\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, обществознание/иностранный язык\n',NULL,109),(111,'Наноинженерия\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',176,118),(112,'Оптотехника\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',177,118),(113,'Приборостроение\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',170,118),(114,'Прикладная информатика\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',247,118),(115,'Прикладная математика и информатика\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',259,118),(116,'Программная инженерия\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',247,118),(117,'Проектирование авиационных и ракетных двигателей\n','КНИТУ-КАИ\n','Специалитет | Очная\n','математика, русский, физика/информатика\n',211,118),(118,'Радиотехника\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',201,118),(119,'Радиоэлектронные системы и комплексы\n','КНИТУ-КАИ\n','Специалитет | Очная\n','математика, русский, физика/информатика\n',190,118),(120,'Самолето- и вертолетостроение\n','КНИТУ-КАИ\n','Специалитет | Очная\n','математика, русский, физика/информатика\n',208,118),(121,'Стандартизация и метрология\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',131,118),(122,'Теплоэнергетика и теплотехника\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/химия/информатика\n',157,118),(123,'Техническая физика\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/химия/информатика\n',198,118),(124,'Техническая эксплуатация летательных аппаратов и двигателей\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',131,118),(125,'Техническая эксплуатация транспортного радиооборудования\n','КНИТУ-КАИ\n','Специалитет | Очная\n','математика, русский, физика/информатика\n',176,118),(126,'Техносферная безопасность\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/химия/информатика\n',157,118),(127,'Управление в технических системах\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',224,118),(128,'Управление качеством\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',177,118),(129,'Управление персоналом\n','КНИТУ-КАИ\n','Бакалавриат | Очно-заочная, Очная\n','математика, русский, обществознание/иностранный язык\n',NULL,109),(130,'Экономика\n','КНИТУ-КАИ\n','Бакалавриат | Очно-заочная, Очная\n','математика, русский, обществознание/иностранный язык\n',263,109),(131,'Эксплуатация транспортно-технологических машин и комплексов\n','КНИТУ-КАИ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',201,118),(132,'Электроника и наноэлектроника\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',207,118),(133,'Электроэнергетика и электротехника\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',194,118),(134,'Энергетическое машиностроение\n','КНИТУ-КАИ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',183,118),(135,'Безопасность информационных технологий в правоохранительной сфере\n','КНИТУ\n','Специалитет | Очная\n','математика, русский, физика/информатика\n',218,118),(136,'Биотехнические системы и технологии\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/биология\n',144,118),(137,'Биотехнология\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, химия/биология\n',161,118),(138,'Горное дело\n','КНИТУ\n','Специалитет | Очная\n','математика, русский, физика/химия\n',134,118),(139,'Гостиничное дело\n','КНИТУ\n','Бакалавриат | Очная\n','русский, обществознание, история/иностранный язык\n',NULL,115),(140,'Государственное и муниципальное управление\n','КНИТУ\n','Бакалавриат | Очная\n','русский, обществознание, математика/иностранный язык\n',NULL,115),(141,'Дизайн\n','КНИТУ\n','Бакалавриат | Очно-заочная\n','русский, литература, вступительные\n',NULL,110),(142,'Издательское дело\n','КНИТУ\n','Бакалавриат | Очная\n','русский, обществознание, история/иностранный язык\n',NULL,115),(143,'Инноватика\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',199,118),(144,'Информатика и вычислительная техника\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, информатика\n',226,123),(145,'Информационная безопасность\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',224,118),(146,'Информационные системы и технологии\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, информатика/иностранный язык\n',222,109),(147,'Искусство костюма и текстиля\n','КНИТУ\n','Бакалавриат | Очная\n','русский, история, вступительные\n',229,105),(148,'Конструирование изделий легкой промышленности\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, вступительные\n',221,109),(149,'Конфликтология\n','КНИТУ\n','Бакалавриат | Очная\n','русский, обществознание, история/иностранный язык\n',NULL,115),(150,'Математическое обеспечение и администрирование информационных систем\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',191,118),(151,'Материаловедение и технологии материалов\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',134,109),(152,'Менеджмент\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, обществознание/информатика\n',NULL,123),(153,'Наноинженерия\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/химия\n',161,NULL),(154,'Нефтегазовое дело\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/химия\n',194,118),(155,'Педагогическое образование\n','КНИТУ\n','Бакалавриат | Очно-заочная, Очная\n','русский, обществознание, математика/информатика\n',NULL,124),(156,'Пожарная безопасность\n','КНИТУ\n','Специалитет | Очная\n','математика, русский, физика/химия\n',NULL,118),(157,'Прикладная математика и информатика\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',217,118),(158,'Продукты питания животного происхождения\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, химия/биология\n',134,118),(159,'Продукты питания из растительного сырья\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, химия/биология\n',158,118),(160,'Проектирование технологических машин и комплексов\n','КНИТУ\n','Специалитет | Очная\n','математика, русский, физика/информатика\n',161,NULL),(161,'Профессиональное обучение (по отраслям)\n','КНИТУ\n','Бакалавриат | Очно-заочная\n','математика, русский, обществознание/химия\n',NULL,118),(162,'Сервис\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, обществознание/иностранный язык\n',NULL,109),(163,'Системный анализ и управление\n','КНИТУ\n','Бакалавриат | Очная, Заочная, Очно-заочная\n','математика, русский, физика/информатика\n',183,118),(164,'Социальная работа\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','русский, история, обществознание/иностранный язык\n',212,105),(165,'Социология\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','русский, обществознание, математика/история\n',236,120),(166,'Стандартизация и метрология\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, химия/информатика\n',159,118),(167,'Статистика\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, информатика/иностранный язык\n',188,NULL),(168,'Строительство\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',NULL,118),(169,'Теплоэнергетика и теплотехника\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',174,118),(170,'Технологические машины и оборудование\n','КНИТУ\n','Бакалавриат | Заочная, Очная, Очно-заочная\n','математика, русский, физика/информатика\n',144,118),(171,'Технология и проектирование текстильных изделий\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, вступительные\n',152,NULL),(172,'Технология изделий легкой промышленности\n','КНИТУ\n','Бакалавриат | Очная, Заочная\n','математика, русский, физика/химия\n',159,118),(173,'Технология лесозаготовительных и деревоперерабатывающих производств\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',139,118),(174,'Технология полиграфического и упаковочного производства\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/химия\n',155,NULL),(175,'Технология продукции и организация общественного питания\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, химия/биология\n',216,118),(176,'Технология художественной обработки материалов\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',165,109),(177,'Техносферная безопасность\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/химия\n',157,118),(178,'Туризм\n','КНИТУ\n','Бакалавриат | Заочная\n','русский, история, обществознание/иностранный язык\n',NULL,105),(179,'Управление в технических системах\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',194,118),(180,'Управление качеством\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, химия/информатика\n',170,118),(181,'Фармация\n','КНИТУ\n','Специалитет | Очная\n','русский, химия, математика/биология\n',NULL,118),(182,'Химическая технология\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/химия\n',151,118),(183,'Химическая технология энергонасыщенных материалов и изделий\n','КНИТУ\n','Специалитет | Очная\n','математика, русский, физика/химия\n',136,118),(184,'Холодильная, криогенная техника и системы жизнеобеспечения\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/информатика\n',162,118),(185,'Экономика\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, обществознание/иностранный язык\n',NULL,109),(186,'Электроэнергетика и электротехника\n','КНИТУ\n','Бакалавриат | Заочная, Очная\n','математика, русский, физика/информатика\n',175,118),(187,'Энерго- и ресурсосберегающие процессы в химической технологии, нефтехимии и биотехнологии\n','КНИТУ\n','Бакалавриат | Очная\n','математика, русский, физика/химия\n',145,NULL);
/*!40000 ALTER TABLE `direction` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `like`
--

DROP TABLE IF EXISTS `like`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `like` (
  `id` int NOT NULL AUTO_INCREMENT,
  `like` tinyint(1) NOT NULL,
  `comment_id` int NOT NULL,
  `user_id` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `like`
--

LOCK TABLES `like` WRITE;
/*!40000 ALTER TABLE `like` DISABLE KEYS */;
/*!40000 ALTER TABLE `like` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `log`
--

DROP TABLE IF EXISTS `log`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `log` (
  `id` int NOT NULL AUTO_INCREMENT,
  `text` varchar(100) NOT NULL,
  `user_id` int NOT NULL,
  `date` datetime DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=47 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `log`
--

LOCK TABLES `log` WRITE;
/*!40000 ALTER TABLE `log` DISABLE KEYS */;
INSERT INTO `log` VALUES (1,'Log out',1,'2022-09-26 22:27:00'),(2,'Register',3,'2022-09-26 22:27:33'),(3,'Log out',3,'2022-09-27 00:31:34'),(4,'insert new user',4,NULL),(5,'Register',4,'2022-09-27 00:32:08'),(6,'Log out',4,'2022-09-27 00:35:27'),(7,'insert new user',5,'2022-09-27 03:35:46'),(8,'Register',5,'2022-09-27 00:35:46'),(9,'Comment',12,'2022-09-27 03:40:45'),(10,'Comment',5,'2022-09-27 03:43:08'),(11,'Comment',5,'2022-09-27 03:43:18'),(12,'Comment',5,'2022-09-27 04:16:31'),(13,'Log out',5,'2022-09-27 02:40:12'),(14,'Register',6,'2022-09-27 10:18:02'),(15,'Log out',6,'2022-09-27 07:20:51'),(16,'Register',7,'2022-09-27 10:21:17'),(17,'Comment',7,'2022-09-27 10:22:41'),(18,'Comment',7,'2022-09-27 12:11:30'),(19,'Log out',7,'2022-09-27 09:11:44'),(20,'Register',8,'2022-09-30 18:51:23'),(21,'Log out',8,'2022-09-30 15:52:15'),(22,'Register',9,'2022-09-30 19:55:15'),(23,'Log out',9,'2022-09-30 16:55:43'),(24,'Register',10,'2022-09-30 19:58:20'),(25,'Log out',10,'2022-09-30 17:00:41'),(26,'Log in',10,'2022-09-30 20:04:11'),(27,'Log out',10,'2022-09-30 20:04:11'),(28,'Register',11,'2022-09-30 20:06:39'),(29,'Log out',11,'2022-09-30 20:04:11'),(30,'Register',12,'2022-09-30 20:08:05'),(31,'Log out',12,'2022-09-30 20:09:45'),(32,'Log in',12,'2022-09-30 20:10:07'),(33,'Register',13,'2022-10-04 10:40:22'),(34,'Comment',13,'2022-10-04 10:45:38'),(35,'Log out',13,'2022-10-04 10:53:42'),(36,'Log in',13,'2022-10-04 10:55:41'),(37,'Log out',13,'2022-10-04 11:44:10'),(38,'Register',14,'2022-10-04 11:44:30'),(39,'Comment',14,'2022-10-04 11:45:18'),(40,'Log out',12,'2022-10-05 10:53:02'),(41,'Log in',14,'2022-10-05 10:53:16'),(42,'Log out',14,'2022-10-05 11:10:19'),(43,'Register',15,'2022-10-05 11:12:02'),(44,'Log out',15,'2022-10-05 11:19:20'),(45,'Log in',15,'2022-10-05 11:21:35'),(46,'Comment',15,'2022-10-05 11:24:45');
/*!40000 ALTER TABLE `log` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ranks`
--

DROP TABLE IF EXISTS `ranks`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `ranks` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `score` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ranks`
--

LOCK TABLES `ranks` WRITE;
/*!40000 ALTER TABLE `ranks` DISABLE KEYS */;
INSERT INTO `ranks` VALUES (1,'Абитуриент',0),(2,'Бакалавр',2),(3,'Магистр',4),(4,'Кандидат наук',8),(5,'Доктор наук',16),(6,'Профессор',32);
/*!40000 ALTER TABLE `ranks` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `subject`
--

DROP TABLE IF EXISTS `subject`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `subject` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `min_score` int NOT NULL,
  `max_score` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `subject`
--

LOCK TABLES `subject` WRITE;
/*!40000 ALTER TABLE `subject` DISABLE KEYS */;
INSERT INTO `subject` VALUES (1,'Русский язык',36,100),(2,'Математика',36,100),(3,'Физика',36,100),(4,'Химия',36,100),(5,'История',36,100),(6,'Обществознание',36,100),(7,'Информатика и ИКТ',36,100),(8,'Биология',36,100),(9,'География',36,100),(10,'Иностранный язык',36,100),(11,'Литература',36,100),(12,'Доп. баллы*',0,110);
/*!40000 ALTER TABLE `subject` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `university`
--

DROP TABLE IF EXISTS `university`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `university` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(20) NOT NULL,
  `full_name` varchar(100) NOT NULL,
  `city` varchar(20) NOT NULL,
  `vuzopedia_id` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `university`
--

LOCK TABLES `university` WRITE;
/*!40000 ALTER TABLE `university` DISABLE KEYS */;
INSERT INTO `university` VALUES (1,'КФУ','Казанский (Приволжский) федеральный университет','Казань',1751),(2,'КГЭУ','Казанский государственный энергетический университет','Казань',1782),(3,'КНИТУ','Казанский национальный исследовательский технологический университет','Казань',1773),(4,'КНИТУ-КАИ','Казанский национальный исследовательский технический университет им. А.Н. Туполева - КАИ','Казань',5428);
/*!40000 ALTER TABLE `university` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `user`
--

DROP TABLE IF EXISTS `user`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `user` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(10) NOT NULL,
  `email` varchar(20) NOT NULL,
  `password` varchar(150) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `email` (`email`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `user`
--

LOCK TABLES `user` WRITE;
/*!40000 ALTER TABLE `user` DISABLE KEYS */;
INSERT INTO `user` VALUES (1,'test','test@test','pbkdf2:sha256:260000$arE3l0WGGdhK5VrB$c5aae63211050cb68616d6dc9062b5fb72a2961f93b54faf31f1a0ee696f95ad'),(2,'qqq','q@q','pbkdf2:sha256:260000$ZBazz3nKZwiLtPKR$544efe48e6572b2a0a54a59c7c1714a3c34265b953036796d1a83d0326f27c25'),(3,'new_user','n@n','pbkdf2:sha256:260000$qBTX20ya2qWYYImj$d7eb459aedbc25d02c736bc75d83525622510bd5e31c49574ff7103cc814f585'),(4,'terminator','t@t','pbkdf2:sha256:260000$zFprYsSoOIl51RJo$0bc1cdc1bc6f8ed4b81dd0d79ecda78787cf0438209fd013b305df354660383c'),(5,'jhkbhbj','y@y','pbkdf2:sha256:260000$mpzjt70VLWVVYw3T$f5ce19ed070ee11ca6219f3a0e4733a4aaee84160b27b533f2654023a7d5009e'),(6,'user2','u@u','pbkdf2:sha256:260000$1iawoUHKZBPTjfAk$26129faae1cb5f36812c4350cbffd65b0389e98f714a92bd462a086981d7519a'),(7,'user3','u3@u','pbkdf2:sha256:260000$wfFuLURWE2SkceWO$a7a25d83ec55785610ce106d31a811cb2ed484fb8da7c6ae2a1ae27459c3b35a'),(8,'ghjgjhgj','z@z','pbkdf2:sha256:260000$OA5qWHJFDwR11Vbq$994b6340b0b8bf4ce05a86a487a78f37f2bb3d3fd8ce3b33da212ce004ace1ce'),(9,'hfegjgwjfg','m@m','pbkdf2:sha256:260000$tXD9JNv3qmLXKwGD$1147358b0b20ce706e68bd38357f90d5865e8463913fc7a94722e62ce4fbc9f6'),(10,'pppppp','ll@ll','pbkdf2:sha256:260000$fAfUnoRyhFIBYhYJ$cc09f9a99bf49474adf3cf81e8ea847f3ad24c751285a9d05783400a6b0960f1'),(11,'hh22','h@h','pbkdf2:sha256:260000$9Y18dTmxUGhtVg6H$537c2aca1ab23042175139de3f88b1e8522b665b0471b589cec88ff3d121fc12'),(12,'gggg','g@g','pbkdf2:sha256:260000$dO6u3NmTGDPJvHGb$8d9d3f48f8f5a35c9ee00ef2ef8f4ad33e2689aede51bb2e1eee05dfa133e3c1'),(13,'jerry','jerry@jerry','pbkdf2:sha256:260000$CpUIPrbmh1QlMyrn$65a7488e36320706e6d4008911b088254472fb180438345138cbca28795a0a5d'),(14,'tom','tom@tom','pbkdf2:sha256:260000$yNKLeEbhgePvAfoK$0131527aa2786ffbfcf1a78c1c7ced3751469e02d681ade215d2ee3d77e6dbc0'),(15,'admin','admin@admin','pbkdf2:sha256:260000$Kkefp9UNywcZP6s8$d62aa1bd9e6d483bc3448582aff21b47d6ea5a7d629f88d7bd087f93a38ca368');
/*!40000 ALTER TABLE `user` ENABLE KEYS */;
UNLOCK TABLES;
/*!50003 SET @saved_cs_client      = @@character_set_client */ ;
/*!50003 SET @saved_cs_results     = @@character_set_results */ ;
/*!50003 SET @saved_col_connection = @@collation_connection */ ;
/*!50003 SET character_set_client  = utf8mb4 */ ;
/*!50003 SET character_set_results = utf8mb4 */ ;
/*!50003 SET collation_connection  = utf8mb4_0900_ai_ci */ ;
/*!50003 SET @saved_sql_mode       = @@sql_mode */ ;
/*!50003 SET sql_mode              = 'STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION' */ ;
DELIMITER ;;
/*!50003 CREATE*/ /*!50017 DEFINER=`root`@`localhost`*/ /*!50003 TRIGGER `user_AFTER_INSERT` AFTER INSERT ON `user` FOR EACH ROW BEGIN
	INSERT INTO log Set text = "Register", user_id = NEW.id, date = NOW();
END */;;
DELIMITER ;
/*!50003 SET sql_mode              = @saved_sql_mode */ ;
/*!50003 SET character_set_client  = @saved_cs_client */ ;
/*!50003 SET character_set_results = @saved_cs_results */ ;
/*!50003 SET collation_connection  = @saved_col_connection */ ;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-10-07 18:34:06
